{
	"posts": [
		{
			"id": 27,
			"author": 1,
			"date": "2023-08-02",
			"post": "Things won't work out, so it's not worth investing in."
		},
		{
			"id": 26,
			"author": 1,
			"date": "2023-07-17",
			"time": "10:51 PM",
			"post": "When I confessed my feelings to someone a while ago, it was a completely new experience for me, especially considering it was *toot*. Unfortunately, the outcome was quite messy and left me with negative thoughts. It also triggered a series of stressful events in a very short span of time. I suppose that was to be expected, given that this confusing for me and to the people around me. And yet, here I am, contemplating doing it again. Maybe this time it will turn out well? Hahahahahahahaha."
		},
		{
			"id": 25,
			"author": 1,
			"date": "2023-07-16",
			"time": "08:49 PM",
			"post": "the similarity between trying to make someone like you and actually liking them is that both can be a waste of time and lead to emotionally draining experiences. haha"
		},
		{
			"id": 24,
			"author": 1,
			"date": "2023-07-16",
			"time": "08:45 PM",
			"post": "prolly the reason that i am unhappy right now is  that i expect too much from somebody"
		},
		{
			"id": 23,
			"author": 1,
			"date": "2023-07-13",
			"time": "05:34 PM",
			"post": "realization: i believe i'm being 'super' vulnerable and open, which can make me dependent on someone. i think i need to relearn how to do things independently.\nnot everyone you trust will be there along the way; it will always be you and yourself."
		},
		{
			"id": 22,
			"author": 1,
			"date": "2023-07-12",
			"time": "08:52 PM",
			"post": "man, confrontation isn't my best suit. pls just shoot me."
		},
		{
			"id": 22,
			"author": 1,
			"date": "2023-07-11",
			"time": "08:09 PM",
			"post": "It is often encouraged to respect others and not judge their struggles, but why isn't that the case in reality? It feels hypocritical when you're told you can share your problems with others, only to become the topic of their own endeavors and discussions."
		},
		{
			"id": 21,
			"author": 1,
			"date": "2023-07-11",
			"time": "08:06 PM",
			"post": "To be honest, I cannot accept the person I am becoming. I have been confused for many years now. I believed I could rid myself of this, but it continuously falters, burdening me with more regrets. Why is my burden like this? Why can't I have the kind of problems where I don't have to constantly worry about others' opinions?"
		},
		{
			"id": 20,
			"author": 1,
			"date": "2023-07-11",
			"time": "08:02 PM",
			"post": "I wanted to share my deepest struggle with the people I care about, but every time I gather the courage to do so, they share perspectives that align with the very thing I wanted to share, making me feel unaccepted and unwelcome. Consequently, I lose my words and find it difficult to express myself. If given the chance, I would simply leave this life, hoping that my burdens would dissipate along with it. I yearn to be authentic, but it feels as though the world doesn't want me to be."
		},
		{
			"id": 19,
			"author": 1,
			"date": "2023-07-11",
			"time": "07:57 PM",
			"post": "For some years now, I've been suppressing who I truly am, not fully accepting the idea of embracing my true self. I struggle and feel burdened by what others may think of me. But why should I care about their opinions? Honestly, I'm uncomfortable being the subject of someone's discussion. I always feel like their opinions matter, even now. I can't fully see myself as someone who lives authentically and does what I truly want, and that's frustrating. It's always about the 'people.' Taking a step away from this mindset feels chaotic, as if it may seem. I feel stressed, especially considering what I believe about life. Do other people share the same ideas as I do? Why is it that I constantly feel the need to be accepted by everyone instead of accepting myself for who I truly am?"
		},
		{
			"id": 18,
			"author": 1,
			"date": "2023-07-11",
			"time": "07:30 PM",
			"post": "To be viewed by others as a good person, someone pure, and to receive praise for it, is interesting. However, the truth is that it's not entirely accurate. You merely do things that align with their perception of who you are, but your heart isn't truly in it."
		},
		{
			"id": 17,
			"author": 1,
			"date": "2023-07-11",
			"time": "06:43 PM",
			"post": "It's interesting to think that the things you used to like or love now seem like distant favorites. What I once enjoyed and was excited to do now feels boring. What happened to me? Did I lose a part of myself, or have I simply outgrown what I once was? I just don't know."
		},
		{
			"id": 16,
			"author": 1,
			"date": "2023-07-10",
			"time": "10:24 PM",
			"post": "i dont like the path im heading, but if i dont accept it, ill continue to struggle repeatedly. im unhappy with my current situation, and i want to move forward and break free from it. i just wanted to tell the truth even though it sucks."
		},
		{
			"id": 15,
			"author": 1,
			"date": "2023-07-10",
			"time": "10:24 PM",
			"post": "i dont like the path im heading, but if i dont accept it, ill continue to struggle repeatedly. im unhappy with my current situation, and i want to move forward and break free from it. i just wanted to tell the truth even though it sucks."
		},
		{
			"id": 14,
			"author": 1,
			"date": "2023-06-28",
			"time": "10:12 PM",
			"post": "being in college, i have the opportunity to meet more people with different views on life. but, when i do get the chance, i sometimes feel a bit weirded out haha pero apil na ko ato"
		},
		{
			"id": 13,
			"author": 1,
			"date": "2023-06-21",
			"time": "06:37 PM",
			"post": "What I like about sports is the 'bond' or camaraderie, where people who may not be very close appear close due to their shared goal. Even when simply watching, it's not uncommon to observe the joy, laughter, and unified shouts of celebration when a goal is achieved. Regardless of their differences, everyone becomes united.\nIf we were to compare this to our daily lives, instead of focusing on our differences, perhaps the world would be a better place."
		},
		{
			"id": 12,
			"author": 1,
			"date": "2023-06-21",
			"time": "02:18 PM",
			"photo": "ground.jpg",
			"post": "The weather is nice, ikaw nalay kulang. It's much nicer to spend the afternoon with you."
		},
		{
			"id": 12,
			"author": 1,
			"date": "2023-06-13",
			"time": "10:50 PM",
			"photo": "beach.jpg",
			"post": "So, I admit that I have been acting childish lately. I've been developing feelings for someone, or maybe just engaging in conversations with people I'm interested in, and perhaps even making fun of others' feelings without considering the impact it could have on them or myself. Now, as I reflect on my actions, it's clear to me that I have been immature and childish in this regard. I've lost sight of the discipline I used to practice and forgotten the kind of person I should strive to be. Upon thinking, reflecting, and taking the time to ponder this whole mess, I am deeply sorry to those I have wronged. I have been stressed and burdened by my personal life, and I may have unintentionally projected my frustrations onto others in an attempt to make myself feel better. I now realize that this was a mistake. So, once again, I sincerely apologize to the people I have hurt or treated insensitively, as it was never my intention.\nFurthermore, during the time I have had to wind down and reflect, I have come to the realization that I am not ready for a serious commitment in a relationship. Perhaps I was just feeling lonely and thought that being in a relationship would alleviate that feeling, but it turns out it doesn't work that way. Liking someone is not the same as loving them. (This is the reality.)\nTherefore, I am acknowledging my mistake and actively working on improving myself so that when the time is right and the Lord blesses me with the right person, I will also be prepared to be a better one. 🙂"
		},
		{
			"id": 11,
			"author": 1,
			"date": "2023-06-11",
			"time": "07:12 PM",
			"post": "I don't know about you, but talking with strangers feels like a breath of fresh air to me. It's funny how you're not sure if you'll click with them at first, but once the conversation gets going, it feels like catching up with an old friend. It's incredible to uncover just how alike we all are and how much we share in common with those around us. And the best part? Creating meaningful connections with people you've just met is so fulfilling. Those simple interactions with others can truly uplift our souls!"
		},
		{
			"id": 10,
			"author": 1,
			"date": "2023-06-09",
			"time": "10:20 AM",
			"post": "\"Who needs superheroes when we have each other\" - Nathaniel Drew"
		},
		{
			"id": 9,
			"author": 1,
			"date": "2023-06-03",
			"time": "11:21 AM",
			"photo": "kids1.jpg",
			"post": "As an extension classes and Sunday school teacher for young and not-so-young kids, I often find myself questioning whether I effectively convey the message or lesson I should be teaching them. Sometimes, I doubt my ability to be an effective teacher for these kids. There are also moments of frustration with them (kay di gyud maminaw hahaha). \n\nHowever, on the brighter side, there is a great sense of fulfillment in being able to share the 'good news', teach Bible stories and lessons, and have fun with them. I'm grateful to have this role and to give back something. It not only helps the kids but also contributes to my personal growth. It helps me build my confidence and ability to communicate with people. The good things you do really pay back in good ways.\n\nFulfillment doesn't stem from self-satisfaction, but from the deeds we share in collaboration.\n\n(The pictures are from different times.)\n\n#saturdayministry\n#extensionclass"
		},
		{
			"id": 8,
			"author": 1,
			"date": "2023-06-02",
			"time": "09:59 PM",
			"post": "I do believe that truth prevails\nbut i do not know when it tells.\nBurdened as you might think,\ncan't move forward but just sink.\n\nStill confused with what and why,\naccepting the reality by and by.\nFeels a sudden turn of life,\ncarrying on in the state of strife."
		},
		{
			"id": 7,
			"author": 1,
			"date": "2023-06-01",
			"time": "06:26 PM",
			"post": "I've lost sight of what used to drive me.\n\n\nAs I continue down my chosen career path, I've noticed a gradual loss of the enthusiasm and joy that once fueled me. It's not just about achieving educational goals; it's about the things that used to bring me genuine happiness. I find myself increasingly absorbed in meaningless content, thoughts, decisions, and actions.\n\nThe transition from childhood innocence to adulthood has made me acutely aware of the weight of my experiences—the positive, the negative, the regrets, and the consequences of past choices. I've made decisions that weren't always wise, and my impulsive nature has become a burden I carry. I no longer recognize the person I once was. I mistakenly believed that wisdom and maturity would come solely from certain accomplishments, but I've come to understand that true growth necessitates enduring more pain, heartbreak, and failure in life. It is within these challenging moments that one truly learns and evolves. Often, the achievement of something positive comes at a cost.\n\nExternally, others perceive me as someone to admire—a leader, a kind person—but deep down, I am aware of hidden secrets and the weight of guilt that eats away at me. The good I do does not outweigh the burden of the mistakes I hold onto.\n\nWho am I truly? Why do my actions fail to align with the faith I possess? It feels as though I am torn between reaching for the light with one hand while clinging to the darkness with the other. I struggle to determine who I should be, or even who I could be."
		},
		{
			"id": 6,
			"author": 1,
			"date": "2023-05-30",
			"time": "05:33 PM",
			"photo": "coke.jpg",
			"post": "For almost three years, I stopped drinking Coke or any soft drinks. Today, I am about to break that record! Haha!"
		},
		{
			"id": 5,
			"author": 1,
			"date": "2023-05-18",
			"time": "03:42 PM",
			"post": "shout-out to unannounced announcement. we are more than happy."
		},
		{
			"id": 4,
			"author": 1,
			"date": "2023-05-15",
			"time": "01:27 PM",
			"post": "frustrating: not be able to deliver what you've been asked to esp if there's a lot of effort given\n\n#frustratedpanda"
		},
		{
			"id": 3,
			"author": 1,
			"date": "2023-04-18",
			"time": "01:25 PM",
			"post": "I like someone but I'm not sure,\nMy feelings are a muddled blur.\nI ache for something I can't define,\nA longing for a love that's kind.\n\nI yearn for care and love so pure,\nYet doubts within my heart endure.\nI question if my feelings are true,\nOr if they're just a passing view."
		},
		{
			"id": 2,
			"author": 1,
			"date": "2023-03-03",
			"time": "11:27 AM",
			"post": "It is impressive to see how Microsoft invested billions of dollars into integrating ChatGPT into their own ecosystem, including Bing, Edge, and the latest update in Windows 11. This move is not exclusive to Microsoft, as other companies are likely to follow suit.\n\nIt is like witnessing a technological revolution, although we are currently in the plateau stage. This investment underscores the inevitability of change and the danger of complacency (as exemplified by Google)."
		},
		{
			"id": 1,
			"author": 1,
			"date": "2023-02-22",
			"time": "8:54 PM",
			"post": "The challenge with sharing your accomplishments is that some people may perceive it as boasting, while the challenge with expressing your enthusiasm is that others may view it as prideful. However, the ultimate challenge of being yourself is that there will always be individuals who will have their perceptions and judgments about you, regardless of your intentions."
		}
	]
}
